Revit 2026 API

# FillPatternExportToPAT Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool ExportToPAT(
	IList<FillPattern> fillPatterns,
	string filename
)
```
```vb
Public Shared Function ExportToPAT (
	fillPatterns As IList(Of FillPattern),
	filename As String
) As Boolean
```
```cpp
public:
static bool ExportToPAT(
	IList<FillPattern^>^ fillPatterns,
	String^ filename
)
```
```fsharp
static member ExportToPAT :
        fillPatterns : IList<FillPattern> *
        filename : string -> bool
```

#### Parameters

fillPatterns IListFillPattern

filename String

#### Return Value

Boolean

#### Reference

FillPattern Class

Autodesk.Revit.DB Namespace